<p style="text-align:center;">
<img src="https://github.com/digital-futures-academy/DataScienceMasterResources/blob/main/Resources/datascience-notebook-header.png?raw=true"
     alt="DigitalFuturesLogo"
     style="float: center; margin-right: 10px;" />
</p>

# Digital Futures Pandas Challenge

- This challenge will consist of a set of exercises related to the Pandas package.

- You will have 75 minutes to finish - add, commit and push to run the tests - enter the final score as your submission on Noodle. You should keep an eye on time and make sure you will be able to do this

- To complete the exercises, use the additional files in the same folder as this notebook.  Do not edit any files other than this Notebook and make sure that you follow all instructions!

When committing your code, only include the code that you are asked for - this will help ensure automated grading can take place.

In [2]:
import pandas as pd

## Task 1. Data Import and Data Frames

### Task 1.1

> Read in the 'students.csv' file that is in the same directory as this notebook into a DataFrame called `students_df`.  
> Display the first 6 rows of the DataFrame to check

In [24]:
students_csv = "students.csv"
students_df = pd.read_csv(students_csv)
students_df.head(6)

   ID  Year Class
0   1     5     A
1   2     7     A
2   3     7     B
3   4     5     C
4   5     5     C
5   6     6     A

### Task 1.2

> Read in the 'students_marks.csv' file as another DataFrame called `students_marks_df`.

In [25]:
students_marks_csv = "students_marks.csv"
students_marks_df = pd.read_csv(students_marks_csv)
students_marks_df

      ID  L1  L2  Maths  Philosophy
0      1   6  10     10           5
1      2   5   7      9           6
2      3   9   8      6          10
3      4   9   7      7           5
4      5  10   8      7           7
..   ...  ..  ..    ...         ...
195  196   6   7      9           8
196  197   7   5      9           9
197  198   5   7      7           9
198  199   6   6      8          10
199  200   5   8      5           6

[200 rows x 5 columns]

### Task 1.3

> Set 'ID' as the index in both data frames.

In [26]:
students_df.set_index('ID', inplace=True)
students_df

students_marks_df.set_index('ID', inplace=True)
students_marks_df

     L1  L2  Maths  Philosophy
ID
1     6  10     10           5
2     5   7      9           6
3     9   8      6          10
4     9   7      7           5
5    10   8      7           7
..   ..  ..    ...         ...
196   6   7      9           8
197   7   5      9           9
198   5   7      7           9
199   6   6      8          10
200   5   8      5           6

[200 rows x 4 columns]

### Task 1.4

> Join the two tables together into a new DataFrame called `students_data_df`.

In [27]:
students_data_df = pd.merge(students_df, students_marks_df, on= 'ID')
students_data_df

     Year Class  L1  L2  Maths  Philosophy
ID
1       5     A   6  10     10           5
2       7     A   5   7      9           6
3       7     B   9   8      6          10
4       5     C   9   7      7           5
5       5     C  10   8      7           7
..    ...   ...  ..  ..    ...         ...
196     6     A   6   7      9           8
197     5     B   7   5      9           9
198     7     C   5   7      7           9
199     7     A   6   6      8          10
200     6     A   5   8      5           6

[200 rows x 6 columns]

---

## Task 2 - Working with New Data

### Task 2.1

> Reproduce the below table by creating a new DataFrame from scratch - call it `new_students_df`.  
> - Feel free to use lists, series or dictionaries but make sure the columns are named correctly. 
> Add it to the bottom of the original DataFrame.

![Extra Students](https://github.com/digital-futures-academy/DataScienceMasterResources/blob/main/Resources/extra_students.png?raw=True")

In [28]:
data = {
    'ID': [201, 202, 203],
    'Year': [7, 5, 5],
    'Class': ['A', 'A', 'B'],
    'L1': [8, 8, 8],
    'L2': [6, 6, 5],
    'Maths': [8, 10, 10],
    'Philosophy': [7, 9, 5]
}
new_students_df = pd.DataFrame(data)
new_students_df.set_index('ID', inplace=True)
new_students_df

     Year Class  L1  L2  Maths  Philosophy
ID
201     7     A   8   6      8           7
202     5     A   8   6     10           9
203     5     B   8   5     10           5

### Task 2.2

> Combine this new DataFrame with the original DataFrame `students_data_df` and save it as `all_students_data_df`.

In [29]:
#concat
all_students_data_df = pd.concat([students_data_df, new_students_df])
all_students_data_df

     Year Class  L1  L2  Maths  Philosophy
ID
1       5     A   6  10     10           5
2       7     A   5   7      9           6
3       7     B   9   8      6          10
4       5     C   9   7      7           5
5       5     C  10   8      7           7
..    ...   ...  ..  ..    ...         ...
199     7     A   6   6      8          10
200     6     A   5   8      5           6
201     7     A   8   6      8           7
202     5     A   8   6     10           9
203     5     B   8   5     10           5

[203 rows x 6 columns]

---

## Task 3 - Adding Columns and Slicing

### Task 3.1

> Absences need to be recorded - add a column the the `all_students_data_df` DataFrame with the name `Absences` and starting all values ***`0`***.

In [30]:
all_students_data_df['Absences'] = 0
all_students_data_df

     Year Class  L1  L2  Maths  Philosophy  Absences
ID
1       5     A   6  10     10           5         0
2       7     A   5   7      9           6         0
3       7     B   9   8      6          10         0
4       5     C   9   7      7           5         0
5       5     C  10   8      7           7         0
..    ...   ...  ..  ..    ...         ...       ...
199     7     A   6   6      8          10         0
200     6     A   5   8      5           6         0
201     7     A   8   6      8           7         0
202     5     A   8   6     10           9         0
203     5     B   8   5     10           5         0

[203 rows x 7 columns]

### Task 3.2

>Using `loc` (not `iloc`!), set the number of absences of the student with `id` `3` to `2`.

In [31]:
all_students_data_df.loc[3:3, ['Absences']] = 2
all_students_data_df.loc[3:3, :]

    Year Class  L1  L2  Maths  Philosophy  Absences
ID
3      7     B   9   8      6          10         2

### Task 3.3

>Using `iloc` (not `loc`!), set the number of absences of the student with `id` `2` to `1`.

In [32]:
all_students_data_df.iloc[1:2 , 6:7] = 1
all_students_data_df

     Year Class  L1  L2  Maths  Philosophy  Absences
ID
1       5     A   6  10     10           5         0
2       7     A   5   7      9           6         1
3       7     B   9   8      6          10         2
4       5     C   9   7      7           5         0
5       5     C  10   8      7           7         0
..    ...   ...  ..  ..    ...         ...       ...
199     7     A   6   6      8          10         0
200     6     A   5   8      5           6         0
201     7     A   8   6      8           7         0
202     5     A   8   6     10           9         0
203     5     B   8   5     10           5         0

[203 rows x 7 columns]

## Task 4 - Modifying and Aggregating Data Frames

### Task 4.1

> Create a pivot table called `num_of_students_in_each_class` with:
> 
> - `Year` as the rows (indexes),
> - `Class` as the columns, and
> - The number of students as the values.
>
> Ensure that:
> 
> - You use a single column (e.g., `"L1"`) for the `values` parameter.
> - Any non-numeric values are replaced with `0`.
> - The resulting pivot table should not have multi-level columns.

In [33]:
all_students_data_df['L1'] = (
    pd.to_numeric(all_students_data_df['L1'],
                  errors='coerce')
      .fillna(0)
    )

num_of_students_in_each_class = pd.pivot_table(all_students_data_df, values='L1', index='Year', columns='Class', aggfunc=['count'])
num_of_students_in_each_class

      count
Class     A   B   C
Year
5        34  21  20
6        24  13  19
7        25  25  22

### Task 4.2

> The school wants to change scoring system, and replace 1-10 with a letter grade.  
> Write a function that will change 10 to A, 9/8 to B, 7/6 to C and any lower scores to D.

In [34]:
# Do not change the name of this method!
def grading_change(x: int) -> str:
    # Implement your logic below and replace the pass statement with your code
    grade = 'to be assigned'
    if x == 10:
        grade = 'A'
    elif (x == 9) or (x == 8):
        grade = 'B'
    elif (x == 7) or (x == 6):
        grade = 'C'
    elif (x < 6):
        grade = 'D'
    else:
        print('Something is wrong with grading logic')
    return grade
# End grading_change - do not delete!

### Task 4.3

> Use the function to ***permanently change*** the grades in the grade columns in the `all_students_data_df` DataFrame.

In [35]:
all_students_data_df['Maths'] = all_students_data_df['Maths'].apply(grading_change)
all_students_data_df['Philosophy'] = all_students_data_df['Philosophy'].apply(grading_change)
all_students_data_df['L1'] = all_students_data_df['L1'].apply(grading_change)
all_students_data_df['L2'] = all_students_data_df['L2'].apply(grading_change)
all_students_data_df

     Year Class L1 L2 Maths Philosophy  Absences
ID
1       5     A  C  A     A          D         0
2       7     A  D  C     B          C         1
3       7     B  B  B     C          A         2
4       5     C  B  C     C          D         0
5       5     C  A  B     C          C         0
..    ...   ... .. ..   ...        ...       ...
199     7     A  C  C     B          A         0
200     6     A  D  B     D          C         0
201     7     A  B  C     B          C         0
202     5     A  B  C     A          B         0
203     5     B  B  D     A          D         0

[203 rows x 7 columns]

---

## Task 5 - Further Analysis

### Task 5.1

> Create a Data Frame (assign it to a new variable called `math_a_students`) from the `all_students_data_df` DataFrame.  
> It should show all students who achieved an `A` in `Maths`. Then, show their `Class`, and *mark* in `L1`, `L2` and `Maths`.

In [36]:
math_a_students = all_students_data_df.loc[all_students_data_df['Maths'] == 'A' ].copy()
math_a_students[['Class', 'L1', 'L2', 'Maths']]

    Class L1 L2 Maths
ID
1       A  C  A     A
7       B  A  C     A
8       B  B  D     A
9       A  C  B     A
12      B  D  C     A
13      B  B  A     A
27      A  C  B     A
28      A  B  C     A
33      A  B  B     A
62      A  D  D     A
65      C  B  A     A
70      C  C  D     A
74      A  C  D     A
87      A  B  D     A
91      A  C  A     A
94      C  C  D     A
109     A  D  C     A
120     A  A  C     A
121     A  C  D     A
127     B  B  C     A
128     C  C  D     A
138     C  C  C     A
141     B  D  B     A
156     A  D  D     A
162     B  C  A     A
164     A  D  B     A
165     A  B  C     A
167     A  B  B     A
168     B  B  A     A
169     C  C  D     A
170     A  C  C     A
171     B  D  B     A
176     C  B  B     A
177     B  C  C     A
185     A  D  C     A
192     B  C  C     A
193     B  C  B     A
202     A  B  C     A
203     B  B  D     A

### Task 5.2

> Permanently sort the new DataFrame by the descending marks in `L1`.

In [37]:
math_a_students.sort_values('L1', ascending=False, inplace=True)
math_a_students

     Year Class L1 L2 Maths Philosophy  Absences
ID
164     7     A  D  B     A          A         0
12      6     B  D  C     A          B         0
156     5     A  D  D     A          B         0
141     6     B  D  B     A          B         0
185     5     A  D  C     A          D         0
62      6     A  D  D     A          B         0
171     5     B  D  B     A          C         0
109     5     A  D  C     A          B         0
1       5     A  C  A     A          D         0
94      6     C  C  D     A          D         0
162     7     B  C  A     A          C         0
138     6     C  C  C     A          D         0
128     5     C  C  D     A          C         0
170     7     A  C  C     A          A         0
121     7     A  C  D     A          A         0
169     7     C  C  D     A          D         0
91      7     A  C  A     A          C         0
74      7     A  C  D     A          C         0
70      7     C  C  D     A          B         0
177     7     B  C  C     A          B         0
192     6     B  C  C     A          B         0
27      6     A  C  B     A          C         0
193     7     B  C  B     A          B         0
9       6     A  C  B     A          D         0
168     7     B  B  A     A          B         0
202     5     A  B  C     A          B         0
176     7     C  B  B     A          B         0
127     6     B  B  C     A          A         0
167     7     A  B  B     A          C         0
165     7     A  B  C     A          A         0
87      7     A  B  D     A          B         0
65      5     C  B  A     A          C         0
33      7     A  B  B     A          C         0
28      7     A  B  C     A          B         0
13      6     B  B  A     A          B         0
8       5     B  B  D     A          C         0
203     5     B  B  D     A          D         0
7       7     B  A  C     A          C         0
120     7     A  A  C     A          A         0

### Task 5.3

> Display the first 10 rows of the sorted DataFrame.

In [38]:
math_a_students.head(10)

     Year Class L1 L2 Maths Philosophy  Absences
ID
164     7     A  D  B     A          A         0
12      6     B  D  C     A          B         0
156     5     A  D  D     A          B         0
141     6     B  D  B     A          B         0
185     5     A  D  C     A          D         0
62      6     A  D  D     A          B         0
171     5     B  D  B     A          C         0
109     5     A  D  C     A          B         0
1       5     A  C  A     A          D         0
94      6     C  C  D     A          D         0

---

In [7]:
df = pd.DataFrame(zip(['A', 'B', 'C', 'A'], ['D', 'A', 'B', 'B']), columns = ['grade1', 'grade2'])

df.head()

  grade1 grade2
0      A      D
1      B      A
2      C      B
3      A      B

**Additional Notes**  
Using **.Map()**

In [ ]:
df_map = df.copy()
    
for name in df.columns:
    df_map.loc[:, name] = df_map.loc[:, name].map({'A': 1, 'B':2, 'C':3, 'D':4})
    
df_map

  grade1 grade2
0      1      4
1      2      1
2      3      2
3      1      2

Using **.replace()**

Using **.apply()**. 
* It takes the logic from N-1 dimensions and projects it to N dimensions
* It works on any dimension, but needs to project on 1 higher

In [ ]:
def my_grades(x):  # zero- dimension logic
    if x == 'A':
        return 1
    elif x =='B':
        return 2
    elif x == "C":
        return 3
    else:
        return 4

In [12]:
df_apply = df.copy()

In [ ]:
df_apply['grade1'] = df_apply['grade1'].apply(my_grades) # like a for loop!
df_apply

   grade1 grade2
0       1      D
1       2      A
2       3      B
3       1      B

In [ ]:
df_apply.apply(lambda x: x.apply(my_grades))  #x is a series a one - dimension object

   grade1  grade2
0       4       4
1       4       1
2       4       2
3       4       2

In [ ]:
df2 = pd.DataFrame(zip([1,2,3,-8], [7,2,3,1]), columns = ['num1', 'num2']) 
# Apply to all cols x**2 -3

In [ ]:
#solution 1
def my_maths(x):
    return ((x**2) -3)
df2.apply(lambda x: x.apply(my_maths))

   num1  num2
0    -2    46
1     1     1
2     6     6
3    61    -2

In [23]:
#solution 2 only lambda
df2.apply(lambda x:x.apply(lambda x: ((x**2) - 3)))

   num1  num2
0    -2    46
1     1     1
2     6     6
3    61    -2